#### BuiltInFailures.UniqueElementFailures Members

---

|  |
| --- |
| BuiltInFailures UniqueElementFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures UniqueElementFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ProhibitUniqueElementDeletion | Internal setting '%1!s!' is required by Revit and has been deleted. |

# See Also

BuiltInFailures UniqueElementFailures Class

Autodesk.Revit.DB Namespace